old-posts/2013-02-28-a-case-for-prototypes.html
---
layout: post
title:  A Case for Prototypes
snip:   How Prototypes make Claire's architecture simple and awesome!
redirect_from:
  - /2013/02/28/a-case-for-prototypes.html
date: 2013-02-28
---

<p>
Two days ago I started working on my own implementation of <a href="http://en.wikipedia.org/wiki/QuickCheck">QuickCheck</a>, since
none of the implementations I saw for JavaScript did quite what I wanted. So, I
sat down to outline the major goals of <a href="http://github.com/killdream/claire">Claire</a>:
</p>
<ul>
<li>Provide the means for property-based testing. For pure functionality.

</li>
<li>Provide the means for random program generation. For complex,
    state-dependant functionality.

</li>
<li>Provide core primitives and combinators for random-data generation. This
    way domain-specific generators can be easily derived by combining
    primitives.

</li>
<li>Be a nice DSL for use in JavaScript.
</li>
</ul>


<p>
So I started drafting the initial API that would satisfy those goals (ignoring
program generation for now, since I decided to leave that for later), and
decided on two basic data types:
</p>



<pre class="src src-haskell"><span style="color: #ACAE95;">-- | Describes a property and its specifications</span>
<span style="color: #C48DFF;">type</span> <span style="color: #FC951E;">Property</span>
  arguments    <span style="color: #729FCF;">::</span> [<span style="color: #FC951E;">Gen</span> a]
  classifiers  <span style="color: #729FCF;">::</span> [(a<span style="color: #729FCF;">...</span> <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Maybe</span> b)]
  implications <span style="color: #729FCF;">::</span> [(a<span style="color: #729FCF;">...</span> <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Bool</span>)]
  invariant    <span style="color: #729FCF;">::</span> (a<span style="color: #729FCF;">...</span> <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Bool</span>)

  <span style="color: #ACAE95;">-- | The DSL</span>
  satisfy  <span style="color: #729FCF;">::</span> <span style="color: #729FCF;">@</span><span style="color: #FC951E;">Property</span> <span style="color: #729FCF;">=&gt;</span> (a<span style="color: #729FCF;">...</span> <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Bool</span>) <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Property</span>
  classify <span style="color: #729FCF;">::</span> <span style="color: #729FCF;">@</span><span style="color: #FC951E;">Property</span> <span style="color: #729FCF;">=&gt;</span> (a<span style="color: #729FCF;">...</span> <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Maybe</span> b) <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Property</span>
  given    <span style="color: #729FCF;">::</span> <span style="color: #729FCF;">@</span><span style="color: #FC951E;">Property</span> <span style="color: #729FCF;">=&gt;</span> (a<span style="color: #729FCF;">...</span> <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Bool</span>) <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Property</span>


<span style="color: #ACAE95;">-- | Describes a way of randomly generate a series of values</span>
<span style="color: #C48DFF;">type</span> <span style="color: #FC951E;">Gen</span> a
  size   <span style="color: #729FCF;">::</span> <span style="color: #FC951E;">Int</span>
  next   <span style="color: #729FCF;">::</span> <span style="color: #FC951E;">()</span> <span style="color: #729FCF;">-&gt;</span> a

<span style="color: #ACAE95;">-- | A semantic way of getting a Property than Property.make()</span>
<span style="color: #67D9F0;">forAll</span> <span style="color: #729FCF;">::</span> <span style="color: #FC951E;">Gen</span> a<span style="color: #729FCF;">...</span> <span style="color: #729FCF;">-&gt;</span> <span style="color: #FC951E;">Property</span>
</pre>


<p>
I'll use these types as a basis for the rest of the article. If you don't know
Haskell's type annotation syntax, it suffices to say that <code>::</code> describes the
type of the thing on the left, <code>[a]</code> describes a list of <code>a</code>'s, and <code>a -&gt; b</code>
describes a function that takes a value <code>a</code>, and returns a value <code>b</code>. I've
added <code>@a =&gt; b</code> for describing a function that, when applied to type <code>a</code> (as
<code>this</code>), yields a value of type <code>b</code>. And the ellipsis to denote variadic
functions.
</p>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Maintaining purity</h2>
<div class="outline-text-2" id="text-1">


<p>
First of all, I wanted the DSLs of properties to be pure. That means that, even
though you'll be writing things like:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">sqrt_p</span> = forAll( Int )
             .satisfy(<span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">n</span>){ <span style="color: #C48DFF;">return</span> Math.sqrt(n * n) == n })
</pre>


<p>
The <code>satisfy</code> function should not change the <code>Property</code> instance that it was
applied to. Instead, it should always return a new <code>Property</code> instance. Thus,
when you write things like:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">all_positive_ints</span> = forAll( Int )
                        .given(<span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">n</span>) { <span style="color: #C48DFF;">return</span> n &gt; 0 })

<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">sqrt_p</span> = all_positive_ints
             .satisfy(<span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">n</span>) { <span style="color: #C48DFF;">return</span> Math.sqrt(n * n) == n })
</pre>


<p>
Even though <code>satisfy</code> modifies the <code>invariant</code> field of a <code>Property</code>,
<code>all_positive_ints</code> and <code>sqrt_p</code> should be two different data structures. It
could be obviously achieved by creating a new object, copying all fields of the
previous object in the new one, and changing the <code>invariant</code> field, but
prototypes make that both dead simple and efficient (in terms of processing
power and memory usage).
</p>
<p>
So, turns out the implementation for this is just a simple and straight-forward
one-line (the actual implementation is simpler due to both LiveScript's syntax
and the fact that Property inherits from Boo's <code>Base</code> object):
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">derive</span> = require(<span style="color: #A6E32D;">'boo'</span>).derive

<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">Property</span> = {
  <span style="color: #75766A;">/* </span><span style="color: #75766A;">(...) */</span>
  <span style="color: #67D9F0;">satisfy</span>: <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">f</span>) { <span style="color: #C48DFF;">return</span> derive(<span style="color: #FA2573;">this</span>, { invariant: f }) }
}
</pre>


<dl>
<dt>note</dt><dd>
<p>
  So, <code>derive</code> here is just a thin abstraction over <code>Object.create</code> that
  creates a new <code>Object</code> which delegates to another object (<code>this</code>, in the case
  above), and extends that new object with the given properties.
</p></dd>
</dl>


<p>
If you inspect the values of <code>invariant</code>, you'll get:
</p>



<pre class="src src-js">all_positive_ints.invariant
<span style="color: #75766A;">// </span><span style="color: #75766A;">(Function) =&gt; function (){</span>
<span style="color: #75766A;">//                 </span><span style="color: #75766A;">throw Error('unimplemented');</span>
<span style="color: #75766A;">//               </span><span style="color: #75766A;">}</span>

sqrt_p.invariant
<span style="color: #75766A;">// </span><span style="color: #75766A;">(Function) =&gt; function (n){</span>
<span style="color: #75766A;">//                 </span><span style="color: #75766A;">return Math.sqrt(n * n) === n;</span>
<span style="color: #75766A;">//               </span><span style="color: #75766A;">}</span>

all_positive_ints.isPrototypeOf(sqrt_p)
<span style="color: #75766A;">// </span><span style="color: #75766A;">(Boolean) =&gt; true</span>
</pre>


<p>
So, this is a cheap trick, and not really new (I've used it on a parser
combinator library I was writing ages ago). But it's a cheap trick that gets
the work done extremely well, in a simple way (both to write and to reason
about) and still manages to be fairly efficient. We couldn't really ask for
more ;3
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">The real deal</h2>
<div class="outline-text-2" id="text-2">


<p>
Things start getting a lot more awesome when we take a look at how Generators
were modelled, specially when we take into account the combinators defined for
creating new Generators. Here's the deal:
</p>
<ul>
<li>We want generators to follow the pure model Properties do.

</li>
<li>We want combinators to be expressive, but still easy enough to write.
</li>
</ul>


<p>
I could have used functions, in which case those would be relatively easy to
achieve due to the higher-order facility in JavaScript, but a Generator
actually encodes more than just a way of generating the next value. It also
knows how to shrink a value it has generated, and how to display itself to the
user in a human-readable and concise way for debugging purposes.
</p>
<p>
So, I was stuck with objects, and I still had to satisfy the two constraints
above. Well, meet the redemption: Prototypes. Prototypes are a really great fit
in this case because, even though all generators obey the basic <code>Gen a</code>
structural type, they can be based in any kind of generator that the user may
come up with. Since we have prototypes rather than classes, it's entirely
possible to encode this complex and dynamic hierarchy as simple functions as
combinators. Yes, we get all we need from combinators, and still have
combinators as plain functions (that yield new Generators).
</p>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">The `asGenerator' combinator</h3>
<div class="outline-text-3" id="text-2-1">


<p>
So, the first and most basic generator is the <code>asGenerator</code>. This is a function
that takes any value <code>a</code>, and returns a Generator that will always yield that
value (or the result of applying a function, if <code>a</code> is a function). On the
other hand, if the function receives a generator as value, it works like the
identity function. This allows us to lift a regular primitive value, like a
Boolean or a String, into a generator:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">True</span> = asGenerator(<span style="color: #FA2573;">true</span>)
True.next() <span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; (Boolean) true</span>
</pre>


<p>
The core <code>Generator</code> object inherits from Boo's <code>Base</code> object, so it's rather
easy to write a function like <code>asGenerator</code>, and in fact all other generators
take advantage of this sugar. The following is a slightly simplified version of
<code>asGenerator</code>:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">asGenerator</span>(<span style="color: #729FCF;">a</span>) {
  <span style="color: #C48DFF;">return</span> generatorP(a)?   a
       : <span style="color: #75766A;">/* </span><span style="color: #75766A;">otherwise */</span>  Generator.derive({
                            <span style="color: #67D9F0;">next</span>: <span style="color: #C48DFF;">function</span>(){ <span style="color: #C48DFF;">return</span> a }
                          })
}
</pre>


<p>
In a class based language, specially those that are less expressive, like Java,
you would have to encode the <code>asGenerator</code> function as a whole new Class,
making the implementation unnecessarily complicated.
</p>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">The `choice' and `frequency' combinators</h3>
<div class="outline-text-3" id="text-2-2">


<p>
On top of the lifting generator, a clear second step is to provide people with
a way to alternatively select between different generators to create a new
value. These roles are satisfied by the <code>choice</code> combinator, which takes
several generators and generates a value using one of them in an uniformly
distributed pseudo-random choice. And then there's the <code>frequency</code> combinator,
which does almost the same as <code>choice</code>, but uses a weighted distribution
instead.
</p>
<p>
So, what's the big deal here? Ain't those other two cases that you could encode
as a class? Well, sure. You can always encode things using something in
computer science, but that doesn't mean it'll be easy, simple or
straight-forward. And I want the three of those characteristics.
</p>
<p>
Using these combinators looks like this:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">vowels</span> = choice(<span style="color: #A6E32D;">'a'</span>, <span style="color: #A6E32D;">'e'</span>, <span style="color: #A6E32D;">'i'</span>, <span style="color: #A6E32D;">'o'</span>, <span style="color: #A6E32D;">'u'</span>)
<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">coins</span> = frequency([3, <span style="color: #FA2573;">true</span>], [5, <span style="color: #FA2573;">false</span>])
</pre>


<p>
Since both <code>choice</code> and <code>frequency</code> leverage <code>asGenerator</code>, you can pass either
simple values or generators over to them. In fact, one of the nice things about
using objects as generators is that checking if something is a generator is
easy: you just check the conformance to the structural type <code>Gen a</code>.
</p>
<p>
This is a simplified implementation of <code>choice</code> and <code>frequency</code>:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">choice</span>() {
  <span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">gs</span> = toArray(<span style="color: #FA2573;">arguments</span>).map(asGenerator)
  <span style="color: #C48DFF;">return</span> Generator.derive({
           <span style="color: #67D9F0;">next</span>: <span style="color: #C48DFF;">function</span>() { <span style="color: #C48DFF;">return</span> pickOne(gs).next() }
         })
}

<span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">frequency</span>() {
  <span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">gs</span> = toArray(<span style="color: #FA2573;">arguments</span>).reduce(weightedConcat, [])
  <span style="color: #C48DFF;">return</span> choice.apply(<span style="color: #FA2573;">null</span>, gs)

  <span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">weightedConcat</span>(<span style="color: #729FCF;">r</span>, <span style="color: #729FCF;">x</span>) {
    <span style="color: #C48DFF;">return</span> r.concat(replicate(x[0], x[1]))
  }
}
</pre>



</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">And finally, the `repeat' combinator</h3>
<div class="outline-text-3" id="text-2-3">


<p>
Once we have all this in place, we can also generate lists of things, and this
is easily done by the <code>repeat</code> combinator. In fact, the <code>List</code> core generator
is a thin abstraction on the <code>repeat</code> combinator, just so you don't have to
type <code>repeat(choice(...))</code>. 
</p>
<p>
Now, this is where the magic of prototypes truly shine. I didn't tell you until
now, but all generators need to maintain all of the properties of the previous
generator. All of them! This is because other generators might depend on those
properties (for example, <code>size</code>). And in fact, the <code>size</code> field plays a huge
and important role in the <code>repeat</code> combinator, since it will only generate
lists of values up to that length!
</p>
<p>
Now, enough talk, this is how the <code>repeat</code> combinator looks for reals:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">numbers</span> = repeat(<span style="color: #C48DFF;">function</span>(){ <span style="color: #C48DFF;">return</span> randInt(0, 10) })
</pre>


<p>
Pretty straight forward, huh? So is the simplified implementation:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">repeat</span>(<span style="color: #729FCF;">g</span>) {
  <span style="color: #C48DFF;">return</span> asGenerator(g).derive({
           <span style="color: #67D9F0;">next</span>: <span style="color: #C48DFF;">function</span>() {
             <span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">range</span> = Array(randInt(0, <span style="color: #FA2573;">this</span>.size)).join(0).split(0)
             <span style="color: #C48DFF;">return</span> range.map(g.next.bind(g))
           }
         })
}
</pre>


<p>
So, now we're taking any kind of <code>Generator</code>, an instance, and making a new
kind of <code>Generator</code> that efficiently shares all the properties defined in the
previous generator, but also defines its own properties. This is the true
beauty of prototypical inheritance: instances inheriting directly from
instances.
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Conclusion</h2>
<div class="outline-text-2" id="text-3">


<p>
There's much more to <a href="http://github.com/killdream/claire">Claire</a> than what I've shown above, but those are out of
the scope of this blog post, which was to outline how you can take advantage of
prototypical inheritance to create awesome things, since you're already coding
in a language that provides it for you. Dynamic delegation chains are sweet for
lots of things, these are just some of them.
</p>
<p>
Perhaps I might write a new blog post on some other aspect of Claire (for
instance, shrinking or program generation, when those are done). But I don't
know, I've got some other quite hot and sweet topics to talk about as well! :3
</p>
<p>
Anyways, hope you guys can see now why inheriting directly from objects is a
Darn Good Thing™. And why I still think that <code>Function.prototype</code> is an
anti-pattern in the language, which should be avoided (although it's undeniably
fast).
</p>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Acknowledgements</h2>
<div class="outline-text-2" id="text-4">


<p>
Thanks to <code>Theo</code> for pointing out that <code>abcde</code> aren't vowels ;3
</p></div>
</div>


<div class="contact-footer">
    You might have noticed that Quil likes prototypes. It's not an obsession, but it's somewhat close to that. You can contact her on <a href="https://twitter.com/robotlolita">Twitter</a>.
</div>
